koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F0xx/Driver/USART_STM32F0xx.c
/*
 * Copyright (C) 2019-2023 Sergey Koshkin <koshkin.sergey@gmail.com>
 * All rights reserved
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * Project: USART Driver for STMicroelectronics STM32F0xx
 */

/*******************************************************************************
 *  includes
 ******************************************************************************/

#include "USART_STM32F0xx.h"

#include <Driver/GPIO_STM32F0xx.h>
#include <Driver/RCC_STM32F0xx.h>
#include <asm/stm32f0xx.h>

#if defined(USE_USART1) || defined(USE_USART2) || defined(USE_USART3) || \
    defined(USE_USART4) || defined(USE_USART5) || defined(USE_USART6) || \
    defined(USE_USART7) || defined(USE_USART8)

/*******************************************************************************
 *  external declarations
 ******************************************************************************/

/*******************************************************************************
 *  defines and macros (scope: module-local)
 ******************************************************************************/

#define USART_DRV_VERSION DRIVER_VERSION_MAJOR_MINOR(1,0)

/*******************************************************************************
 *  typedefs and structures (scope: module-local)
 ******************************************************************************/

/*******************************************************************************
 *  function prototypes (scope: module-local)
 ******************************************************************************/

static
int32_t USART_Send(const void *data, uint32_t num, const USART_RESOURCES *usart);
static
int32_t USART_Receive(void *data, uint32_t num, const USART_RESOURCES *usart);

/*******************************************************************************
 *  global variable definitions (scope: module-local)
 ******************************************************************************/

/* Driver Version */
static const DRIVER_VERSION usart_driver_version = {
    USART_API_VERSION,
    USART_DRV_VERSION
};

static const GPIO_PIN_CFG_t USART_pin_cfg_af = {
    GPIO_MODE_AF_PP, GPIO_PULL_DISABLE, GPIO_SPEED_LOW
};

static const GPIO_PIN_CFG_t USART_pin_cfg_input = {
    GPIO_MODE_INPUT, GPIO_PULL_DISABLE, GPIO_SPEED_LOW
};

static const GPIO_PIN_CFG_t USART_pin_cfg_out_pp = {
    GPIO_MODE_OUT_PP, GPIO_PULL_DISABLE, GPIO_SPEED_LOW
};

/* USART1 */
#ifdef USE_USART1

/* USART1 Run-Time Information */
static USART_INFO          USART1_Info         = {0};
static USART_TRANSFER_INFO USART1_TransferInfo = {0};

#ifdef USE_USART1_TX_Pin
static USART_PIN USART1_tx = {
    USART1_TX_GPIO_PORT,
    USART1_TX_GPIO_PIN,
    USART1_TX_GPIO_FUNC
};
#endif

#ifdef USE_USART1_RX_Pin
static USART_PIN USART1_rx = {
    USART1_RX_GPIO_PORT,
    USART1_RX_GPIO_PIN,
    USART1_RX_GPIO_FUNC
};
#endif

#ifdef USE_USART1_CK_Pin
static USART_PIN USART1_ck = {
    USART1_CK_GPIO_PORT,
    USART1_CK_GPIO_PIN,
    USART1_CK_GPIO_FUNC
};
#endif

#ifdef USE_USART1_RTS_Pin
static USART_PIN USART1_rts = {
    USART1_RTS_GPIO_PORT,
    USART1_RTS_GPIO_PIN,
    USART1_RTS_GPIO_FUNC
};
#endif

#ifdef USE_USART1_CTS_Pin
static USART_PIN USART1_cts = {
    USART1_CTS_GPIO_PORT,
    USART1_CTS_GPIO_PIN,
    USART1_CTS_GPIO_FUNC
};
#endif

/* USART1 Resources */
static const USART_RESOURCES USART1_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#ifdef USE_USART1_CK_Pin
    1,  // supports Synchronous Master mode
#else
    0,  // supports Synchronous Master mode
#endif
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    0,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#ifdef USE_USART1_RTS_Pin
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#ifdef USE_USART1_CTS_Pin
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref USART_EVENT_RX_TIMEOUT
#ifdef USE_USART1_RTS_Pin
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#ifdef USE_USART1_CTS_Pin
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#ifdef USE_USART1_CTS_Pin
    1,  // Signal CTS change event: \ref USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref USART_EVENT_DSR
    0,  // Signal DCD change event: \ref USART_EVENT_DCD
    0,  // Signal RI change event: \ref USART_EVENT_RI
  },
  USART1,
  RCC_PERIPH_USART1,
  // PINS
  {
#ifdef USE_USART1_TX_Pin
    &USART1_tx,
#else
    NULL,
#endif
#ifdef USE_USART1_RX_Pin
    &USART1_rx,
#else
    NULL,
#endif
#ifdef USE_USART1_CK_Pin
    &USART1_ck,
#else
    NULL,
#endif
#ifdef USE_USART1_RTS_Pin
    &USART1_rts,
#else
    NULL,
#endif
#ifdef USE_USART1_CTS_Pin
    &USART1_cts,
#else
    NULL,
#endif
  },
  USART1_IRQn,
#ifdef USART1_TX_DMA_Instance
  &USART1_DMA_Tx,
#else
  NULL,
#endif
#ifdef USART1_RX_DMA_Instance
  &USART1_DMA_Rx,
#else
  NULL,
#endif
  &USART1_Info,
  &USART1_TransferInfo
};
#endif

