koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F0xx/Driver/USART_STM32F0xx.c
/*******************************************************************************
 *  function implementations (scope: module-local)
 ******************************************************************************/

/**
 * @fn          void PinConfig(const USART_PIN *io, const GPIO_PIN_CFG_t *pin_cfg)
 * @brief       Configure Pin
 * @param[in]   io       Pointer to USART_PIN
 * @param[in]   pin_cfg  Pointer to GPIO_PIN_CFG_t
 */
static
void PinConfig(const USART_PIN *io, const GPIO_PIN_CFG_t *pin_cfg)
{
  if ((io == NULL) || (pin_cfg == NULL)) {
    return;
  }

  if (GPIO_GetPortClockState(io->port) == GPIO_PORT_CLK_DISABLE) {
    GPIO_PortClock(io->port, GPIO_PORT_CLK_ENABLE);
  }

  if (pin_cfg->mode == GPIO_MODE_AF_PP || pin_cfg->mode == GPIO_MODE_AF_OD) {
    GPIO_AFConfig(io->port, io->pin, io->func);
  }

  GPIO_PinConfig(io->port, io->pin, pin_cfg);
}

/**
 * @fn          DRIVER_VERSION USARTx_GetVersion(void)
 * @brief       Get driver version.
 * @return      \ref DRIVER_VERSION
 */
static DRIVER_VERSION USARTx_GetVersion(void)
{
  return (usart_driver_version);
}

/**
 * @fn          USART_CAPABILITIES USART_GetCapabilities(const USART_RESOURCES *usart)
 * @brief       Get driver capabilities
 * @param[in]   usart     Pointer to USART resources
 * @return      \ref USART_CAPABILITIES
 */
static USART_CAPABILITIES USART_GetCapabilities(const USART_RESOURCES *usart)
{
  return (usart->capabilities);
}

/**
 * @fn          int32_t USART_Initialize(USART_SignalEvent_t cb_event, const USART_RESOURCES *usart)
 * @brief       Initialize USART Interface.
 * @param[in]   cb_event  Pointer to \ref USART_SignalEvent
 * @param[in]   usart     Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_Initialize(USART_SignalEvent_t cb_event, const USART_RESOURCES *usart)
{
  USART_INFO          *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;

  if (info->flags & USART_FLAG_INITIALIZED) {
    /* Driver is already initialized */
    return (DRIVER_OK);
  }

  /* Initialize USART Run-time Resources */
  info->cb_event                = cb_event;

  info->status.tx_busy          = 0U;
  info->status.rx_busy          = 0U;
  info->status.tx_underflow     = 0U;
  info->status.rx_overflow      = 0U;
  info->status.rx_break         = 0U;
  info->status.rx_framing_error = 0U;
  info->status.rx_parity_error  = 0U;

  info->mode                    = 0U;
  xfer->send_active             = 0U;

  /* Clear transfer information */
  memset(xfer, 0, sizeof(USART_TRANSFER_INFO));

  info->flags = USART_FLAG_INITIALIZED;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t USART_Uninitialize(const USART_RESOURCES *usart)
 * @brief       De-initialize USART Interface.
 * @param[in]   usart     Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_Uninitialize(const USART_RESOURCES *usart)
{
  USART_IO             *io      = &usart->io;
  const GPIO_PIN_CFG_t *pin_cfg = &USART_pin_cfg_input;

  /* Unconfigure USART pins */
  PinConfig(io->tx, pin_cfg);
  PinConfig(io->rx, pin_cfg);
  PinConfig(io->ck, pin_cfg);
  PinConfig(io->rts, pin_cfg);
  PinConfig(io->cts, pin_cfg);

  /* Reset USART status flags */
  usart->info->flags = 0U;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t USART_PowerControl(POWER_STATE state)
 * @brief       Control USART Interface Power.
 * @param[in]   state  Power state
 * @param[in]   usart  Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_PowerControl(POWER_STATE state, const USART_RESOURCES *usart)
{
  USART_INFO          *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;

  switch (state) {
    case POWER_OFF:
      /* Peripheral reset */
      RCC_ResetPeriph(usart->periph);
      /* Disable IRQ */
      NVIC_DisableIRQ(usart->irq_num);

#ifdef __USART_DMA
      /* Deinitialize DMA */
      DMA_ChannelUninitialize((DMA_INFO *)usart->dma_rx);
      DMA_ChannelUninitialize((DMA_INFO *)usart->dma_tx);
#endif

      /* Disable USART clock */
      RCC_DisablePeriph(usart->periph);

      /* Clear Status flags */
      info->status.tx_busy          = 0U;
      info->status.rx_busy          = 0U;
      info->status.tx_underflow     = 0U;
      info->status.rx_overflow      = 0U;
      info->status.rx_break         = 0U;
      info->status.rx_framing_error = 0U;
      info->status.rx_parity_error  = 0U;
      xfer->send_active             = 0U;

      info->flags &= ~USART_FLAG_POWERED;
      break;

    case POWER_FULL:
      if ((info->flags & USART_FLAG_INITIALIZED) == 0U) {
        return (DRIVER_ERROR);
      }

      if ((info->flags & USART_FLAG_POWERED) != 0U) {
        return (DRIVER_OK);
      }

      /* Clear Status flags */
      info->status.tx_busy          = 0U;
      info->status.rx_busy          = 0U;
      info->status.tx_underflow     = 0U;
      info->status.rx_overflow      = 0U;
      info->status.rx_break         = 0U;
      info->status.rx_framing_error = 0U;
      info->status.rx_parity_error  = 0U;

      xfer->send_active             = 0U;
      xfer->def_val                 = 0U;
      xfer->sync_mode               = 0U;
      xfer->break_flag              = 0U;
      info->mode                    = 0U;
      info->flow_control            = 0U;

      info->flags |= USART_FLAG_POWERED;

      /* Enable USART clock */
      RCC_EnablePeriph(usart->periph);

      /* Clear and Enable USART IRQ */
      NVIC_ClearPendingIRQ(usart->irq_num);
      NVIC_SetPriority(usart->irq_num, RTE_USART_INT_PRIORITY);
      NVIC_EnableIRQ(usart->irq_num);

#ifdef __USART_DMA
      /* Initialize DMA */
      DMA_ChannelInitialize((DMA_INFO *)usart->dma_rx);
      DMA_ChannelInitialize((DMA_INFO *)usart->dma_tx);
#endif

      /* Peripheral reset */
      RCC_ResetPeriph(usart->periph);
      break;

    case POWER_LOW:
    default:
      return (DRIVER_ERROR_UNSUPPORTED);
  }

  return (DRIVER_OK);
}

/**
 * @fn          int32_t USART_Send(const void *data, uint32_t num, const USART_RESOURCES *usart)
 * @brief       Start sending data to USART transmitter.
 * @param[in]   data  Pointer to buffer with data to send to USART transmitter
 * @param[in]   num   Number of data items to send
 * @param[in]   usart Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_Send(const void *data, uint32_t num, const USART_RESOURCES *usart)
{
  USART_INFO          *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;
  USART_TypeDef       *reg  = usart->reg;
  uint32_t             cr1;

