koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F0xx/Driver/USART_STM32F0xx.c
#ifdef __USART_DMA_TX
  uint32_t cfg;
#endif

  if ((data == NULL) || (num == 0U)) {
    /* Invalid parameters */
    return (DRIVER_ERROR_PARAMETER);
  }

  if ((info->flags & USART_FLAG_CONFIGURED) == 0U) {
    /* USART is not configured (mode not selected) */
    return (DRIVER_ERROR);
  }

  if (xfer->send_active != 0U) {
    /* Send is not completed yet */
    return (DRIVER_ERROR_BUSY);
  }

  cr1 = reg->CR1;

  /* Set Send active flag */
  xfer->send_active = 1U;

  /* Save transmit buffer info */
  xfer->tx_buf = (uint8_t *)data;
  xfer->tx_num = num;
  xfer->tx_cnt = 0U;

#ifdef __USART_DMA_TX
  cfg = DMA_MEMORY_INCREMENT;
#endif

  /* Synchronous mode */
  if (info->mode == USART_MODE_SYNCHRONOUS_MASTER) {
    if (xfer->sync_mode == 0U) {
      xfer->sync_mode = USART_SYNC_MODE_TX;
      /* Start dummy reads */
      int32_t stat = USART_Receive(&xfer->dump_val, num, usart);
      if (stat == DRIVER_ERROR_BUSY) {
        return (DRIVER_ERROR_BUSY);
      }

#ifdef __USART_DMA_TX
    }
    else {
      if (xfer->sync_mode == USART_SYNC_MODE_RX) {
        /* Dummy DMA writes (do not increment source address) */
        cfg = 0;
      }
#endif
    }
  }

#ifdef __USART_DMA_TX
  /* DMA mode */
  if (usart->dma_tx) {
    /* Configure and enable tx DMA channel */
    cfg |= (DMA_PRIORITY(usart->dma_tx->priority) | DMA_MEMORY_TO_PERIPHERAL | DMA_TRANSFER_COMPLETE_INTERRUPT);

    if (((cr1 & USART_CR1_M) != 0U) && ((cr1 & USART_CR1_PCE) == 0U)) {
      // 9-bit data frame, no parity
      cfg |= DMA_PERIPHERAL_DATA_16BIT | DMA_MEMORY_DATA_16BIT;
    }

    DMA_ChannelConfigure(usart->dma_tx->instance, cfg, (uint32_t)(&reg->DR), (uint32_t)data, num);
    DMA_ChannelEnable(usart->dma_tx->instance);

    /* DMA Enable transmitter */
    reg->CR3 |= USART_CR3_DMAT;
  }
  else
#endif
  {
    /* Interrupt mode */
    /* TXE interrupt enable */
    reg->CR1 = cr1 | USART_CR1_TXEIE;
  }

  return (DRIVER_OK);
}

/**
 * @fn          int32_t USART_Receive(void *data, uint32_t num, const USART_RESOURCES *usart)
 * @brief       Start receiving data from USART receiver.
 * @param[out]  data  Pointer to buffer for data to receive from USART receiver
 * @param[in]   num   Number of data items to receive
 * @param[in]   usart Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_Receive(void *data, uint32_t num, const USART_RESOURCES *usart)
{
  USART_INFO          *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;
  USART_TypeDef       *reg = usart->reg;
  uint32_t             cr1;

#ifdef __USART_DMA_RX
  uint32_t cfg;
#endif

  if ((data == NULL) || (num == 0U)) {
    /* Invalid parameters */
    return (DRIVER_ERROR_PARAMETER);
  }

  if ((info->flags & USART_FLAG_CONFIGURED) == 0U) {
    /* USART is not configured (mode not selected) */
    return (DRIVER_ERROR);
  }

  /* Check if receiver is busy */
  if (info->status.rx_busy == 1U) {
    return (DRIVER_ERROR_BUSY);
  }

  /* Disable RXNE Interrupt */
  reg->CR1 &= ~USART_CR1_RXNEIE;

  /* Save number of data to be received */
  xfer->rx_num                  = num;

  /* Clear RX statuses */
  info->status.rx_break         = 0U;
  info->status.rx_framing_error = 0U;
  info->status.rx_overflow      = 0U;
  info->status.rx_parity_error  = 0U;

  /* Save receive buffer info */
  xfer->rx_buf                  = (uint8_t *)data;
  xfer->rx_cnt                  = 0U;

  /* Set RX busy flag */
  info->status.rx_busy          = 1U;

  cr1 = reg->CR1;

#ifdef __USART_DMA_RX

  cfg = DMA_MEMORY_INCREMENT;

  /* Synchronous mode */
  if (info->mode == USART_MODE_SYNCHRONOUS_MASTER) {
    if (xfer->sync_mode == USART_SYNC_MODE_TX) {
      /* Dummy DMA reads (do not increment destination address) */
      cfg = 0U;
    }
  }

  /* DMA mode */
  if (usart->dma_rx) {
    /* Configure and enable rx DMA channel */
    cfg |= DMA_PRIORITY(usart->dma_rx->priority) | DMA_PERIPHERAL_TO_MEMORY | DMA_TRANSFER_COMPLETE_INTERRUPT;

    if (((cr1 & USART_CR1_M) != 0U) && ((cr1 & USART_CR1_PCE) == 0U)) {
      /* 9-bit data frame, no parity */
      cfg |= DMA_PERIPHERAL_DATA_16BIT | DMA_MEMORY_DATA_16BIT;
    }

    DMA_ChannelConfigure(usart->dma_rx->instance, cfg, (uint32_t)(&reg->DR), (uint32_t)data, num);
    DMA_ChannelEnable(usart->dma_rx->instance);

    reg->CR3 |= USART_CR3_DMAR;
    /* Enable IDLE interrupt */
    reg->CR1 = cr1 | USART_CR1_IDLEIE;
  }
  else
#endif
  {
    /* Enable RXNE and IDLE interrupt */
    reg->CR1 = cr1 | USART_CR1_IDLEIE | USART_CR1_RXNEIE;
  }

  /* Synchronous mode */
  if (info->mode == USART_MODE_SYNCHRONOUS_MASTER) {
    if (xfer->sync_mode == 0U) {
      xfer->sync_mode = USART_SYNC_MODE_RX;
      /* Send dummy data */
      int32_t stat = USART_Send(&xfer->def_val, num, usart);
      if (stat == DRIVER_ERROR_BUSY) {
        return DRIVER_ERROR_BUSY;
      }
    }
  }

  return (DRIVER_OK);
}

/**
 * @fn          int32_t USART_Transfer(const void *data_out, void *data_in, uint32_t num, const USART_RESOURCES *usart)
 * @brief       Start sending/receiving data to/from USART transmitter/receiver.
 * @param[in]   data_out  Pointer to buffer with data to send to USART transmitter
 * @param[out]  data_in   Pointer to buffer for data to receive from USART receiver
 * @param[in]   num       Number of data items to transfer
 * @param[in]   usart     Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_Transfer(const void *data_out, void *data_in, uint32_t num, const USART_RESOURCES *usart)
{
  int32_t status;
  USART_INFO *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;

  if ((data_out == NULL) || (data_in == NULL) || (num == 0U)) {
    /* Invalid parameters */
    return (DRIVER_ERROR_PARAMETER);
  }

  if ((info->flags & USART_FLAG_CONFIGURED) == 0U) {
    /* USART is not configured */
    return (DRIVER_ERROR);
  }

  if (info->mode == USART_MODE_SYNCHRONOUS_MASTER) {
    /* Set transfer mode */
    xfer->sync_mode = USART_SYNC_MODE_TX_RX;

    /* Receive */
    status = USART_Receive(data_in, num, usart);
    if (status != DRIVER_OK) {
      return (status);
    }

    /* Send */
    status = USART_Send(data_out, num, usart);
    if (status != DRIVER_OK) {
      return (status);
    }

