koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F0xx/Driver/USART_STM32F0xx.c
  }
  else {
    /* Only in synchronous mode */
    return (DRIVER_ERROR);
  }

  return (DRIVER_OK);
}

/**
 * @fn          uint32_t USART_GetTxCount(const USART_RESOURCES *usart)
 * @brief       Get transmitted data count.
 * @param[in]   usart     Pointer to USART resources
 * @return      number of data items transmitted
 */
static
uint32_t USART_GetTxCount(const USART_RESOURCES *usart)
{
#ifdef __USART_DMA_TX
  if (usart->dma_tx) {
    return (usart->xfer->tx_num - DMA_ChannelTransferItemCount(usart->dma_tx->instance));
  }
  else
#endif
  {
    return (usart->xfer->tx_cnt);
  }
}

/**
 * @fn          uint32_t USART_GetRxCount(const USART_RESOURCES *usart)
 * @brief       Get received data count.
 * @param[in]   usart     Pointer to USART resources
 * @return      number of data items received
 */
static
uint32_t USART_GetRxCount(const USART_RESOURCES *usart)
{
#ifdef __USART_DMA_RX
  if (usart->dma_rx) {
    return (usart->xfer->rx_num - DMA_ChannelTransferItemCount(usart->dma_rx->instance));
  }
  else
#endif
  {
    return (usart->xfer->rx_cnt);
  }
}

/**
 * @fn          int32_t USART_Control(uint32_t control, uint32_t arg, const USART_RESOURCES *usart)
 * @brief       Control USART Interface.
 * @param[in]   control  Operation
 * @param[in]   arg      Argument of operation (optional)
 * @param[in]   usart    Pointer to USART resources
 * @return      common \ref execution_status and driver specific \ref usart_execution_status
 */
static
int32_t USART_Control(uint32_t control, uint32_t arg, const USART_RESOURCES *usart)
{
  uint32_t             mode, flow_control;
  uint32_t             cr1, cr2, cr3;
  USART_INFO          *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;
  USART_TypeDef       *reg  = usart->reg;

  if ((info->flags & USART_FLAG_POWERED) == 0U) {
    /* USART not powered */
    return (DRIVER_ERROR);
  }

  cr1 = 0U;
  cr2 = 0U;
  cr3 = 0U;

  switch (control & USART_CONTROL_Msk) {
    // Control break
    case USART_CONTROL_BREAK:
      return DRIVER_ERROR;

    /* Abort Send */
    case USART_ABORT_SEND:
      /* Disable TX and TC interrupt */
      reg->CR1 &= ~(USART_CR1_TXEIE | USART_CR1_TCIE);

      /* If DMA mode - disable DMA channel */
      if ((usart->dma_tx != NULL) && (xfer->send_active != 0)) {
        /* DMA disable transmitter */
        reg->CR3 &= ~USART_CR3_DMAT;

        /* Abort TX DMA transfer */
//        DMA_ChannelDisable(usart->dma_tx->instance);
      }

      /* Clear break flag */
      xfer->break_flag = 0U;
      /* Clear Send active flag */
      xfer->send_active = 0U;
      return (DRIVER_OK);

    /* Abort receive */
    case USART_ABORT_RECEIVE:
      /* Disable RX interrupt */
      reg->CR1 &= ~USART_CR1_RXNEIE;

      /* If DMA mode - disable DMA channel */
      if ((usart->dma_rx != NULL) && (info->status.rx_busy != 0)) {
        /* DMA disable Receiver */
        reg->CR3 &= ~USART_CR3_DMAR;

        /* Abort RX DMA transfer */
//        DMA_ChannelDisable(usart->dma_rx->instance);
      }

      /* Clear RX busy status */
      info->status.rx_busy = 0U;
      return (DRIVER_OK);

    /* Abort transfer */
    case USART_ABORT_TRANSFER:
      /* Disable TX, TC and RX interrupt */
      reg->CR1 &= ~(USART_CR1_TXEIE | USART_CR1_TCIE | USART_CR1_RXNEIE);

      /* If DMA mode - disable DMA channel */
      if ((usart->dma_tx != NULL) && (xfer->send_active != 0U)) {
        /* DMA disable transmitter */
        reg->CR3 &= ~USART_CR3_DMAT;

        /* Abort TX DMA transfer */
//        DMA_ChannelDisable(usart->dma_tx->instance);
      }

      /* If DMA mode - disable DMA channel */
      if ((usart->dma_rx != NULL) && (info->status.rx_busy != 0U)) {
        /* DMA disable Receiver */
        reg->CR3 &= ~USART_CR3_DMAR;

        /* Abort RX DMA transfer */
//        DMA_ChannelDisable(usart->dma_rx->instance);
      }

      /* Clear busy statuses */
      info->status.rx_busy = 0U;
      xfer->send_active = 0U;
      return (DRIVER_OK);

    /* Control TX */
    case USART_CONTROL_TX:
      /* Check if TX pin available */
      if (usart->io.tx == NULL) {
        return (DRIVER_ERROR);
      }

      if (arg) {
        if (info->mode != USART_MODE_SMART_CARD) {
          /* USART TX pin function selected */
          PinConfig(usart->io.tx, &USART_pin_cfg_af);
        }
        info->flags |= USART_FLAG_TX_ENABLED;

        /* Transmitter enable */
        reg->CR1 |= USART_CR1_TE;
      }
      else {
        /* Transmitter disable */
        reg->CR1 &= ~USART_CR1_TE;

        info->flags &= ~USART_FLAG_TX_ENABLED;

        if (info->mode != USART_MODE_SMART_CARD) {
          /* GPIO pin function selected */
          PinConfig(usart->io.tx, &USART_pin_cfg_input);
        }
      }
      return (DRIVER_OK);

    /* Control RX */
    case USART_CONTROL_RX:
      /* Check if RX line available */
      if (usart->io.rx == NULL) {
        return (DRIVER_ERROR);
      }

      if (arg) {
        if ((info->mode != USART_MODE_SMART_CARD) && (info->mode != USART_MODE_SINGLE_WIRE)) {
          /* USART RX pin function selected */
          PinConfig(usart->io.rx, &USART_pin_cfg_af);
        }
        info->flags |= USART_FLAG_RX_ENABLED;

        /* Enable Error interrupt */
        reg->CR3 |= USART_CR3_EIE;
        /* Enable Idle line interrupt */
        reg->CR1 |= USART_CR1_IDLEIE;

        if (((info->status.rx_busy != 0U) && (usart->dma_rx != NULL)) == false) {
          reg->CR1 |= USART_CR1_RXNEIE;
        }

        /* Receiver enable */
        reg->CR1 |= USART_CR1_RE;
      }
      else {
        /* Receiver disable */
        reg->CR1 &= ~USART_CR1_RE;

        info->flags &= ~USART_FLAG_RX_ENABLED;

        if ((info->mode != USART_MODE_SMART_CARD) && (info->mode != USART_MODE_SINGLE_WIRE)) {
          /* GPIO pin function selected */
          PinConfig(usart->io.rx, &USART_pin_cfg_input);
        }
      }
      return (DRIVER_OK);

    default:
      break;
  }

  /* Check if busy */
  if ((info->status.rx_busy != 0U) || (xfer->send_active != 0U)) {
    return (DRIVER_ERROR_BUSY);
  }

  if (((reg->CR1 & USART_CR1_TE) != 0U) && ((reg->ISR & USART_ISR_TC) == 0U)) {
    return DRIVER_ERROR_BUSY;
  }

  switch (control & USART_CONTROL_Msk) {
    case USART_MODE_ASYNCHRONOUS:
      mode = USART_MODE_ASYNCHRONOUS;
      break;

